from pyecharts.charts import WordCloud
from day_01 import words
'''words = [
    ("花鸟市场", 1446),
    ("风水", 93),
    ("面相分析", 47),
    ("手相", 32),
    ("公益", 90),
    ("花鸟市场", 1446),
    ("风水", 93),
    ("面相分析", 47),
    ("手相", 32),
    ("公益", 90),
    ("花鸟市场", 1446),
    ("风水", 93),
    ("面相分析", 47),
    ("手相", 32),
    ("公益", 90),
    ("花鸟市场", 1446),
    ("风水", 93),
    ("面相分析", 47),
    ("手相", 32),
    ("公益", 90),
    ("花鸟市场", 1446),
    ("风水", 93),
    ("面相分析", 47),
    ("手相", 32),
    ("公益", 90),
]
'''
# 创建词云图
wc = WordCloud()
# 使用词云图的添加功能(需要呈现的内容和图片)
wc.add("", words, word_size_range=[12, 12], mask_image="heart.jpg")
wc.render()
