"""
    核心数据类型
        变量没有类型,但是关联的对象有类型.
        data = "10"
        data = 10
        data = 10.0
"""
# 1. 字符串类型str:表达文本
name = "18"
# 2. 整形int：表达整数
# -- 十进制(DEC)：每位用十种状态计数，逢十进一，写法是0~9
number01 = 20
# -- 二进制(BIN)：每位用二种状态计数，逢二进一，写法是0b开头，后跟0或者1。
number02 = 0b10
# -- 八进制(OCT)：每位用八种状态计数，逢八进一，写法是0o开头，后跟0~7。
# 0 1 2 3 ...7  10
number03 = 0o20
# -- 十六进制(HEX)：每位用十六种状态计数，逢十六进一，
#             写法是0x开头，后跟0~9  a(10)~f(15)
number04 = 0x10
# 3. 浮点型float:表达小数
# -- 小数写法
number05 = 1.5
# -- 科学计数法
# 15 × 10 -1
number06 = 15e-1
print(0.00001) # 1e-05
print(1e+5)
